iPig/src/Documents/РасходКормов/РасходКормов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходКормов</name>
  <registerRecords>AccumulationRegister.ДвижениеКормов</registerRecords>
  <tabularSections>
    <name>ТЧКорма</name>
    <attributes>
      <name>Корм</name>
      <type>
        <types>CatalogRef.Корма</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

iPig/src/AccumulationRegisters/ДвижениеКормов/ДвижениеКормов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеКормов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Корм</name>
    <type>
      <types>CatalogRef.Корма</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

iPig/src/Documents/РасходКормов/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	КормаСтрокой = _НастройкиКонфигурацииНаСервере.ПолучитьСписокТЧСтрокой(ТЧКорма, "Корм");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвижениеКормов Расход
	Движения.ДвижениеКормов.Записывать = Истина;
	Для Каждого ТекСтрокаТЧКорма Из ТЧКорма Цикл
		Движение = Движения.ДвижениеКормов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Корм = ТекСтрокаТЧКорма.Корм;
		Движение.Количество = ТекСтрокаТЧКорма.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
